app/controllers/card_controller.rb

	def show
		@card = Card.find_by( set_sym: params[:set_sym] )
---
SELECT  "cards".* FROM "cards" WHERE "cards"."set_sym" = ? LIMIT 1  [["set_sym", "gvg011"]]